[Killed] BlockStatement
bmi.js:1:39
-function bmi(w_lbs, h_foot, h_inches) {
-  // convert w to kg
-  if (typeof w_lbs === 'number' && typeof h_foot === 'number' && typeof h_inches === 'number') {
-    const w_kg = parseFloat(w_lbs / 2.205);
-    const h_meter = ((h_foot * 12 + h_inches) * 2.54) / 100;
-    // infeasible decision point
-    if (w_kg <= 0 || h_meter <= 0 ) { 
-      return -2;
-    }
-    return parseFloat((w_kg / (h_meter * h_meter)).toFixed(2));
-  } else {
-    return -1;
-  }
-}
+function bmi(w_lbs, h_foot, h_inches) {}
 
 module.exports = bmi;
killedBy: BMI Calculator Calculates BMI correctly for valid inputs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 22.15
Received: undefined

[Killed] ConditionalExpression
bmi.js:3:66
 function bmi(w_lbs, h_foot, h_inches) {
   // convert w to kg
-  if (typeof w_lbs === 'number' && typeof h_foot === 'number' && typeof h_inches === 'number') {
+  if (typeof w_lbs === 'number' && typeof h_foot === 'number' && true) {
     const w_kg = parseFloat(w_lbs / 2.205);
     const h_meter = ((h_foot * 12 + h_inches) * 2.54) / 100;
killedBy: BMI Calculator Returns -1 for invalid input types
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: NaN

[Killed] BlockStatement
bmi.js:3:96
 function bmi(w_lbs, h_foot, h_inches) {
   // convert w to kg
-  if (typeof w_lbs === 'number' && typeof h_foot === 'number' && typeof h_inches === 'number') {
-    const w_kg = parseFloat(w_lbs / 2.205);
-    const h_meter = ((h_foot * 12 + h_inches) * 2.54) / 100;
-    // infeasible decision point
-    if (w_kg <= 0 || h_meter <= 0 ) { 
-      return -2;
-    }
-    return parseFloat((w_kg / (h_meter * h_meter)).toFixed(2));
-  } else {
+  if (typeof w_lbs === 'number' && typeof h_foot === 'number' && typeof h_inches === 'number') {} else {
     return -1;
   }
killedBy: BMI Calculator Calculates BMI correctly for valid inputs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 22.15
Received: undefined

[Killed] ArithmeticOperator
bmi.js:4:29
 function bmi(w_lbs, h_foot, h_inches) {
   // convert w to kg
   if (typeof w_lbs === 'number' && typeof h_foot === 'number' && typeof h_inches === 'number') {
-    const w_kg = parseFloat(w_lbs / 2.205);
+    const w_kg = parseFloat(w_lbs * 2.205);
     const h_meter = ((h_foot * 12 + h_inches) * 2.54) / 100;
     // infeasible decision point
killedBy: BMI Calculator Calculates BMI correctly for valid inputs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 22.15
Received: 107.68

[Killed] ArithmeticOperator
bmi.js:5:21
   // convert w to kg
   if (typeof w_lbs === 'number' && typeof h_foot === 'number' && typeof h_inches === 'number') {
     const w_kg = parseFloat(w_lbs / 2.205);
-    const h_meter = ((h_foot * 12 + h_inches) * 2.54) / 100;
+    const h_meter = (h_foot * 12 + h_inches) * 2.54 * 100;
     // infeasible decision point
     if (w_kg <= 0 || h_meter <= 0 ) { 
killedBy: BMI Calculator Calculates BMI correctly for valid inputs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 22.15
Received: 0

[Killed] ArithmeticOperator
bmi.js:5:23
   // convert w to kg
   if (typeof w_lbs === 'number' && typeof h_foot === 'number' && typeof h_inches === 'number') {
     const w_kg = parseFloat(w_lbs / 2.205);
-    const h_meter = ((h_foot * 12 + h_inches) * 2.54) / 100;
+    const h_meter = ((h_foot * 12 - h_inches) * 2.54) / 100;
     // infeasible decision point
     if (w_kg <= 0 || h_meter <= 0 ) { 
killedBy: BMI Calculator Calculates BMI correctly for valid inputs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 22.15
Received: 40.54

[Killed] ConditionalExpression
bmi.js:7:9
     const w_kg = parseFloat(w_lbs / 2.205);
     const h_meter = ((h_foot * 12 + h_inches) * 2.54) / 100;
     // infeasible decision point
-    if (w_kg <= 0 || h_meter <= 0 ) { 
+    if (false ) { 
       return -2;
     }
killedBy: BMI Calculator Returns -2 for invalid input types
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -2
Received: 0

[Killed] ConditionalExpression
bmi.js:7:9
     const w_kg = parseFloat(w_lbs / 2.205);
     const h_meter = ((h_foot * 12 + h_inches) * 2.54) / 100;
     // infeasible decision point
-    if (w_kg <= 0 || h_meter <= 0 ) { 
+    if (false || h_meter <= 0 ) { 
       return -2;
     }
killedBy: BMI Calculator Returns -2 for invalid input types
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -2
Received: 0

[Killed] UnaryOperator
bmi.js:8:14
     const h_meter = ((h_foot * 12 + h_inches) * 2.54) / 100;
     // infeasible decision point
     if (w_kg <= 0 || h_meter <= 0 ) { 
-      return -2;
+      return +2;
     }
     return parseFloat((w_kg / (h_meter * h_meter)).toFixed(2));
killedBy: BMI Calculator Returns -2 for invalid input types
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -2
Received: 2

[Killed] ArithmeticOperator
bmi.js:10:24
     if (w_kg <= 0 || h_meter <= 0 ) { 
       return -2;
     }
-    return parseFloat((w_kg / (h_meter * h_meter)).toFixed(2));
+    return parseFloat((w_kg * (h_meter * h_meter)).toFixed(2));
   } else {
     return -1;
killedBy: BMI Calculator Calculates BMI correctly for valid inputs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 22.15
Received: 208.95

[Killed] ArithmeticOperator
bmi.js:10:32
     if (w_kg <= 0 || h_meter <= 0 ) { 
       return -2;
     }
-    return parseFloat((w_kg / (h_meter * h_meter)).toFixed(2));
+    return parseFloat((w_kg / (h_meter / h_meter)).toFixed(2));
   } else {
     return -1;
killedBy: BMI Calculator Calculates BMI correctly for valid inputs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 22.15
Received: 68.03

[Killed] BlockStatement
bmi.js:11:10
       return -2;
     }
     return parseFloat((w_kg / (h_meter * h_meter)).toFixed(2));
-  } else {
-    return -1;
-  }
+  } else {}
 }
 
killedBy: BMI Calculator Returns -1 for invalid input types
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: undefined

[Killed] UnaryOperator
bmi.js:12:12
     }
     return parseFloat((w_kg / (h_meter * h_meter)).toFixed(2));
   } else {
-    return -1;
+    return +1;
   }
 }
killedBy: BMI Calculator Returns -1 for invalid input types
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: 1
