[Killed] BlockStatement
gradeToLetter.js:1:48
-module.exports = function gradeToLetter(score) {
-  // Check for the non-number or NaN (NaN is typeof number so needs explicit check)
-  
-  if (typeof score !== 'number' || isNaN(score) || score < 0 || score > 100) {
-    return 'Invalid input. Please provide a number.';
-  }
-
-  if (score >= 90) {
-    return "A";
-  }
-  else if (score >= 80) {
-    return "B";
-  } else if (score >= 70) {
-    return "C";
-  } else if (score >= 60) {
-    return "D";
-  } else {
-    return "F";
-  }
-};
+module.exports = function gradeToLetter(score) {};
killedBy: gradeToLetter should return 95 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: undefined

[Killed] EqualityOperator
gradeToLetter.js:4:52
 module.exports = function gradeToLetter(score) {
   // Check for the non-number or NaN (NaN is typeof number so needs explicit check)
   
-  if (typeof score !== 'number' || isNaN(score) || score < 0 || score > 100) {
+  if (typeof score !== 'number' || isNaN(score) || score <= 0 || score > 100) {
     return 'Invalid input. Please provide a number.';
   }
killedBy: gradeToLetter should return 0 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "F"
Received: "Invalid input. Please provide a number."

[Killed] EqualityOperator
gradeToLetter.js:4:7
 module.exports = function gradeToLetter(score) {
   // Check for the non-number or NaN (NaN is typeof number so needs explicit check)
   
-  if (typeof score !== 'number' || isNaN(score) || score < 0 || score > 100) {
+  if (typeof score === 'number' || isNaN(score) || score < 0 || score > 100) {
     return 'Invalid input. Please provide a number.';
   }
killedBy: gradeToLetter should return 95 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: "Invalid input. Please provide a number."

[Killed] ConditionalExpression
gradeToLetter.js:8:7
     return 'Invalid input. Please provide a number.';
   }
 
-  if (score >= 90) {
+  if (true) {
     return "A";
   }
killedBy: gradeToLetter should return 85 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B"
Received: "A"

[Killed] EqualityOperator
gradeToLetter.js:8:7
     return 'Invalid input. Please provide a number.';
   }
 
-  if (score >= 90) {
+  if (score < 90) {
     return "A";
   }
killedBy: gradeToLetter should return 95 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: "B"

[Killed] StringLiteral
gradeToLetter.js:9:12
   }
 
   if (score >= 90) {
-    return "A";
+    return "";
   }
   else if (score >= 80) {
killedBy: gradeToLetter should return 95 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: ""

[Killed] EqualityOperator
gradeToLetter.js:11:12
   if (score >= 90) {
     return "A";
   }
-  else if (score >= 80) {
+  else if (score < 80) {
     return "B";
   } else if (score >= 70) {
killedBy: gradeToLetter should return 85 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B"
Received: "C"

[Killed] ConditionalExpression
gradeToLetter.js:11:12
   if (score >= 90) {
     return "A";
   }
-  else if (score >= 80) {
+  else if (false) {
     return "B";
   } else if (score >= 70) {
killedBy: gradeToLetter should return 85 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B"
Received: "C"

[Killed] StringLiteral
gradeToLetter.js:12:12
     return "A";
   }
   else if (score >= 80) {
-    return "B";
+    return "";
   } else if (score >= 70) {
     return "C";
killedBy: gradeToLetter should return 85 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B"
Received: ""

[Killed] EqualityOperator
gradeToLetter.js:13:14
   }
   else if (score >= 80) {
     return "B";
-  } else if (score >= 70) {
+  } else if (score > 70) {
     return "C";
   } else if (score >= 60) {
killedBy: gradeToLetter should return 70 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "C"
Received: "D"

[Killed] BlockStatement
gradeToLetter.js:13:27
   }
   else if (score >= 80) {
     return "B";
-  } else if (score >= 70) {
-    return "C";
-  } else if (score >= 60) {
+  } else if (score >= 70) {} else if (score >= 60) {
     return "D";
   } else {
killedBy: gradeToLetter should return 75 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "C"
Received: undefined

[Killed] EqualityOperator
gradeToLetter.js:15:14
     return "B";
   } else if (score >= 70) {
     return "C";
-  } else if (score >= 60) {
+  } else if (score > 60) {
     return "D";
   } else {
killedBy: gradeToLetter should return 60 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "D"
Received: "F"

[Killed] BlockStatement
gradeToLetter.js:15:27
     return "B";
   } else if (score >= 70) {
     return "C";
-  } else if (score >= 60) {
-    return "D";
-  } else {
+  } else if (score >= 60) {} else {
     return "F";
   }
killedBy: gradeToLetter should return 65 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "D"
Received: undefined

[Killed] BlockStatement
gradeToLetter.js:17:10
     return "C";
   } else if (score >= 60) {
     return "D";
-  } else {
-    return "F";
-  }
+  } else {}
 };
killedBy: gradeToLetter should return 55 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "F"
Received: undefined

[Killed] StringLiteral
gradeToLetter.js:18:12
   } else if (score >= 60) {
     return "D";
   } else {
-    return "F";
+    return "";
   }
 };
killedBy: gradeToLetter should return 55 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "F"
Received: ""
